1C_config/src/DataProcessors/ПакетноеСозданиеПлатежей/ПакетноеСозданиеПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПакетноеСозданиеПлатежей</name>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>СчетПолучателя</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

1C_config/src/Documents/ПлатежноеПоручение/ПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручение</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

1C_config/src/DataProcessors/ПакетноеСозданиеПлатежей/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel файлы (*.xlsx;*.xls)|*.xlsx;*.xls";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере(Диалог.ПолноеИмяФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ПутьКФайлу)
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.Workbooks.Open(ПутьКФайлу);
		Лист = Excel.Worksheets(1);
		
		Объект.Получатели.Очистить();
		
		НомерСтроки = 2;
		Пока Истина Цикл
			КодСчета = СокрЛП(Лист.Cells(НомерСтроки, 1).Text);
			Если КодСчета = "" Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = Объект.Получатели.Добавить();
			НоваяСтрока.СчетПолучателя = Справочники.БанковскиеСчета.НайтиПоКоду(КодСчета);
			НоваяСтрока.Сумма = Лист.Cells(НомерСтроки, 2).Value;
			
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		Excel.Quit();
		Объект.Результат = "✅ Загружено строк: " + Объект.Получатели.Количество();
		
	Исключение
		Объект.Результат = "❌ Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Объект.Результат = ПроверитьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаСервере()
	
	Если Объект.СчетОтправителя.Пустая() Тогда
		Возврат "❌ Не выбран счет отправителя";
	КонецЕсли;
	
	Если Объект.Получатели.Количество() = 0 Тогда
		Возврат "❌ Нет получателей";
	КонецЕсли;
	
	Для Каждого Стр Из Объект.Получатели Цикл
		Если Стр.СчетПолучателя.Пустая() Или Стр.Сумма <= 0 Тогда
			Возврат "❌ Есть некорректные строки";
		КонецЕсли;
	КонецЦикла;
	
	Возврат "✅ Можно создавать платежи";
	
КонецФункции

&НаКлиенте
Процедура СоздатьПлатежи(Команда)
	
	РезультатПроверки = ПроверитьНаСервере();
	Если Найти(РезультатПроверки, "❌") > 0 Тогда
		Объект.Результат = РезультатПроверки;
		Возврат;
	КонецЕсли;
	
	СоздатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()
	
	Счетчик = 0;
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Платеж = Документы.ПлатежноеПоручение.СоздатьДокумент();
		Платеж.Дата = Объект.ДатаПлатежа;
		Платеж.СчетОтправителя = Объект.СчетОтправителя;
		Платеж.СчетПолучателя = Стр.СчетПолучателя;
		Платеж.Сумма = Стр.Сумма;
		Платеж.НазначениеПлатежа = "Пакетная загрузка из Excel";
		Платеж.Записать(РежимЗаписиДокумента.Проведение);
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Объект.Результат = "✅ Создано платежей: " + Счетчик;
	
КонецПроцедуры
